#include <iostream>
using namespace std;
int main () {
	//8.ƒаны натуральные числа от 20 до 50.Ќапечатать те из них, которые дел€тс€ на 3, но не дел€тс€ на 5.
	/*int b;
	for (b = 20; b <= 50; b++)
	{
		if ((0 == b % 3) && (0 != b % 5))
			cout << b << endl;
	}*/

	//9.даны натуральные числа от 35 до 87. Ќайти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
	/*int b;
	for (b = 35; b <= 87; b++)
	{
		if ((b == b % 7) || (2 == b % 7) || (5 == b % 7))
			cout << b << endl;
	}*/

	//10.ƒаны натуральные числа от 1 до 50. Ќайти сумму тех из них, которые дел€тс€ на 5 или на 7.
	/*int z = 0;
	for (int z = 1; z <= 50; z++)
	{
		if ((0 == z % 7) || (0 == z % 7))
			z = z + i;
			cout << i << endl;
	}*/

	//11. Ќапечатать те из двузначных чисел которые дел€тс€ на 4, но не дел€тс€ на 6.
	/*int b;
	for ( int b = 20; b <= 40; b++)
	{
	if ((0 == b % 4) || (0 == b % 6))
	cout << b << endl;
	}*/
	
	//12. Ќайти произведение двузначных нечетных чисел кратных 13.
	for (int b = 23; b <= 53; b++)
    {
    if (0 == b % 13)
    cout << b << endl;
    }

//13. Ќайти сумму чисел от 100 до 200 кратных 17.
/*int b;
for (int i = 100; i <= 200; b++)
{
if (b % 17 == 0)
b = b + i
cout << i << endl;
}*/

}